float diff, xmag, ymag, newMWeel = 1, wheelMouse = 0, newXmag = 0, newYmag = 0;

// коэффици
int d = 200 * 5;

// год
float epoch = 2000;

// предыдущее время от начала запуска
int prevTime;

PImage skyImage;

// 1 a.e. = 149 597 870 км

float[] 
// ТАБЛИЦА СКОРОСТЕЙ ПЛАНЕТ
// Орбит. скорость (км/с)
speed = { 47.87, 35.02, 29.79, 24.13, 13.06, 9.66, 6.80, 5.44, 4.74, 0 } , 

// ТАБЛИЦА БОЛЬШИХ ПОЛУОСЕЙ ОРБИТ
// Большая полуось (а.е.)
a = { 0.387, 0.723, 1, 1.52, 5.2026, 9.5549, 19.218, 30.11038, 39.5181, 0.0 } , 

// ТАБЛИЦА МАЛЫХ ПОЛУОСЕЙ ОРБИТ
// Малая полуось (а.е.)
// заполним позже (в setup)
b = new float[10] ,  // Малая полуось (а.е.)

// Эксцентриситет
e = { 0.2056, 0.0067, 0.0167, 0.0934, 0.0484, 0.0555, 0.0462, 0.00898, 0.2459, 0 } , 

// (средняя долгота) угол на 2000 год
angle = { 253, 181, 100, 355, 34, 50, 314, 304, 0 , 0 } , 

// размеры планет в Землях
sizeOfPlanets = { 0.382, 0.949, 1.0, 0.53, 11.2, 9.41, 3.98, 3.81, 0.186, 109 / 25 } , 

// углы наклонов осей вращения планет в плоскости эклиптики
angleOfAxis = { 0, 177.36, 23.45, 25.19, 3.13, 25.33, 97.86, 28.31, 122.52, 0 } ,

// периоды обращений (в земных года)
periodsOfPlanets = { 0.241, 0.615, 1.0, 1.881, 11.857, 29.426, 83.749, 163.727, 248, 1.0 };


int zoomSize = 200;
int scaleSizeOfPlanet = 5;



String[] names = {
  "Меркурий",
  "Венера",
  "Земля",
  "Марс",
  "Юпитер",
  "Сатурн",
  "Уран",
  "Нептун",
  "Плутон",
  "Солнце"
};

PImage[] imageOfPlanet;
